# Materials Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Materials Property
GroupTypeId Class See Also
---
Materials and Finishes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Materials { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Materials As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Materials {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace